1. 請問「=」運算的行為的是什麼？以下程式碼會印出的結果是什麼？

x = 123
y = 456

x = y
y = 789

print(x)
print(y)

(1)「=」(賦值)將等號右邊運算的值指定給左邊的變數。
(2)print(x)= 456
   print(y)= 789

2. 在 Python 中，「*」跟「**」運算分別代表什麼，哪一個運算優先順序比較高？

(1)「*」代表乘法，「**」代表指數運算(次方)
(2)「**」（指數運算）的優先順序比「*」（乘法）高

3. 在 Python 中，請問「/」跟「//」運算分別代表什麼，哪一個運算優先順序比較高？

(1)「/」代表除法，「//」代表整數除法
(2)「/」（除法）和「//」（整數除法）優先順序相同

4. 該如何把「4.3」變成整數型態？該如何把「3」變成浮點數型態呢？

(1)int(4.3)  
(2)float(3)  

5. 如果在程式中看到這個錯誤「NameError: name 'n' is not defined」可能的原因是什麼？

未定義的變數 'n'，可能是變數名稱大小寫拼寫錯誤，或是使用尚未宣告過的變數時，就會觸發這個錯誤。
